In [ ]:
/* =========================
   CREATE TABLES & SAMPLE DATA
   ========================= */

-- Sailors-Boats-Reserves Schema
CREATE TABLE Sailors (
    sid INT PRIMARY KEY,
    sname VARCHAR(50),
    age INT,
    rating INT
);

CREATE TABLE Boats (
    bid INT PRIMARY KEY,
    bname VARCHAR(50),
    bcolor VARCHAR(20)
);

CREATE TABLE Reserves (
    sid INT,
    bid INT,
    rdate DATE,
    FOREIGN KEY (sid) REFERENCES Sailors(sid),
    FOREIGN KEY (bid) REFERENCES Boats(bid)
);

-- Sample Data
INSERT INTO Sailors VALUES
(1, 'Andy', 25, 7),
(2, 'Ravi', 35, 8),
(3, 'Meena', 40, 9),
(4, 'Rohit', 29, 6),
(5, 'Priya', 31, 8);

INSERT INTO Boats VALUES
(101, 'Speedy', 'red'),
(102, 'Wave', 'green'),
(103, 'Sailor', 'blue'),
(104, 'Storm', 'red');

INSERT INTO Reserves VALUES
(1, 101, '2024-06-01'),
(1, 102, '2024-06-03'),
(2, 101, '2024-06-05'),
(3, 102, '2024-06-07'),
(4, 103, '2024-06-09'),
(5, 101, '2024-06-10');



/* =========================
   Q1) SET OPERATIONS
   ========================= */

-- 1) Sailors who reserved red or green boat
SELECT s.sname
FROM Sailors s
JOIN Reserves r ON s.sid = r.sid
JOIN Boats b ON r.bid = b.bid
WHERE b.bcolor = 'red'
UNION
SELECT s.sname
FROM Sailors s
JOIN Reserves r ON s.sid = r.sid
JOIN Boats b ON r.bid = b.bid
WHERE b.bcolor = 'green';

-- 2) Sailors who reserved both red and green boats
SELECT s.sname
FROM Sailors s
JOIN Reserves r1 ON s.sid = r1.sid
JOIN Boats b1 ON r1.bid = b1.bid
WHERE b1.bcolor = 'red'
INTERSECT
SELECT s.sname
FROM Sailors s
JOIN Reserves r2 ON s.sid = r2.sid
JOIN Boats b2 ON r2.bid = b2.bid
WHERE b2.bcolor = 'green';

-- 3) Sailors who reserved red boats but not green
SELECT s.sname
FROM Sailors s
JOIN Reserves r ON s.sid = r.sid
JOIN Boats b ON r.bid = b.bid
WHERE b.bcolor = 'red'
EXCEPT
SELECT s.sname
FROM Sailors s
JOIN Reserves r ON s.sid = r.sid
JOIN Boats b ON r.bid = b.bid
WHERE b.bcolor = 'green';

In [ ]:
/* =========================
   Q2) AGGREGATE FUNCTIONS
   ========================= */

-- i) Average age
SELECT AVG(age) AS avg_age FROM Sailors;

-- ii) Minimum age
SELECT MIN(age) AS min_age FROM Sailors;

-- iii) Maximum age
SELECT MAX(age) AS max_age FROM Sailors;

-- iv) Number of sailors
SELECT COUNT(*) AS total_sailors FROM Sailors;

-- v) Total rating
SELECT SUM(rating) AS total_rating FROM Sailors;

-- vi) DCL Commands
-- GRANT SELECT, INSERT ON Sailors TO user1;
-- REVOKE INSERT ON Sailors FROM user1;

In [ ]:
/* =========================
   Q3) NESTED QUERIES
   ========================= */

-- 1) Sailors who reserved boat 103
SELECT sname
FROM Sailors
WHERE sid IN (SELECT sid FROM Reserves WHERE bid = 103);

-- 2) Sailors who have not reserved boat 103
SELECT sname
FROM Sailors
WHERE sid NOT IN (SELECT sid FROM Reserves WHERE bid = 103);

-- 3) Sailor with highest rating
SELECT sid
FROM Sailors
WHERE rating = (SELECT MAX(rating) FROM Sailors);

-- 4) Sailor whose rating is better than Andy
SELECT sid
FROM Sailors
WHERE rating > (SELECT rating FROM Sailors WHERE sname = 'Andy');

In [ ]:
/* =========================
   Q4) GROUP BY, ORDER BY, HAVING
   ========================= */

CREATE TABLE company (
    companyn VARCHAR(50),
    amount INT
);

INSERT INTO company VALUES
('ABC', 5000),
('XYZ', 12000),
('ABC', 8000),
('PQR', 15000),
('XYZ', 4000);

-- 1) Sum of amount of each company
SELECT companyn, SUM(amount) AS total_amount
FROM company
GROUP BY companyn;

-- 2) Minimum amount of each company
SELECT companyn, MIN(amount) AS min_amount
FROM company
GROUP BY companyn;

-- 3) Maximum amount of each company
SELECT companyn, MAX(amount) AS max_amount
FROM company
GROUP BY companyn;

-- 4) Count of rows grouped by each company
SELECT companyn, COUNT(*) AS total_rows
FROM company
GROUP BY companyn;

-- 5) Sum > 10000
SELECT companyn, SUM(amount) AS total_amount
FROM company
GROUP BY companyn
HAVING SUM(amount) > 10000;

In [ ]:
/* =========================
   Q5) UNIVERSITY DATABASE
   ========================= */

CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    StudentName VARCHAR(50),
    Major VARCHAR(50)
);

CREATE TABLE Courses (
    CourseID INT PRIMARY KEY,
    CourseName VARCHAR(50),
    Credits INT
);

CREATE TABLE Enrollments (
    StudentID INT,
    CourseID INT,
    EnrollmentDate DATE,
    FOREIGN KEY (StudentID) REFERENCES Students(StudentID),
    FOREIGN KEY (CourseID) REFERENCES Courses(CourseID)
);

CREATE TABLE Instructors (
    InstructorID INT PRIMARY KEY,
    InstructorName VARCHAR(50),
    Phone VARCHAR(15)
);

-- Sample Data
INSERT INTO Students VALUES (1, 'Ravi', 'CSE'), (2, 'Meena', 'ECE'), (3, 'Rohit', 'MECH');
INSERT INTO Courses VALUES (10, 'Operating Systems', 4), (11, 'DBMS', 3);
INSERT INTO Enrollments VALUES (1, 10, '2024-07-01'), (2, 11, '2024-07-02'), (3, 10, '2024-07-03');
INSERT INTO Instructors VALUES (101, 'Dr. Sharma', '9998887776'), (102, 'Prof. Reddy', '9996665554');

-- 1) All students and majors
SELECT StudentName, Major FROM Students;

-- 2) All courses with credits
SELECT CourseName, Credits FROM Courses;

-- 3) Students enrolled in Operating Systems
SELECT s.StudentName
FROM Students s
JOIN Enrollments e ON s.StudentID = e.StudentID
JOIN Courses c ON e.CourseID = c.CourseID
WHERE c.CourseName = 'Operating Systems';

-- 4) Instructors teaching Operating Systems
SELECT InstructorName
FROM Instructors i
JOIN Courses c ON i.InstructorID = c.CourseID
WHERE c.CourseName = 'Operating Systems';

-- 5) Count students in each course
SELECT c.CourseName, COUNT(e.StudentID) AS total_students
FROM Courses c
JOIN Enrollments e ON c.CourseID = e.CourseID
GROUP BY c.CourseName;

In [ ]:
/* =========================
   Q6) DML COMMANDS + VIEWS
   ========================= */

-- Insert
INSERT INTO Students VALUES (4, 'Priya', 'CSE');

-- Update
UPDATE Students SET Major = 'IT' WHERE StudentID = 4;

-- Delete
DELETE FROM Students WHERE StudentID = 2;

-- Select
SELECT * FROM Students;

-- Create View
CREATE VIEW CS_Students AS
SELECT * FROM Students WHERE Major = 'CSE';

SELECT * FROM CS_Students;

In [ ]:
/* =========================
   Q7) ADDITIONAL SAILORS QUERIES
   ========================= */

-- 1) Sailors older than 30
SELECT sname, age FROM Sailors WHERE age > 30;

-- 2) Rating = 8
SELECT sid, sname, rating FROM Sailors WHERE rating = 8;

-- 3) Sailors who reserved boat 101 or 102
SELECT sid FROM Reserves WHERE bid = 101
UNION
SELECT sid FROM Reserves WHERE bid = 102;

-- 4) Sailor names and boat names reserved
SELECT DISTINCT s.sname, b.bname
FROM Sailors s
JOIN Reserves r ON s.sid = r.sid
JOIN Boats b ON r.bid = b.bid;

-- 5) Maximum age per rating
SELECT rating, MAX(age) AS max_age
FROM Sailors
GROUP BY rating;

In [ ]:
/* =========================
   Q8) JOINS & INDEXES
   ========================= */

-- Natural Join
SELECT * FROM Sailors NATURAL JOIN Reserves;

-- Equi Join
SELECT * FROM Sailors s, Reserves r WHERE s.sid = r.sid;

-- Inner Join
SELECT * FROM Sailors s INNER JOIN Reserves r ON s.sid = r.sid;

-- Left Outer Join
SELECT * FROM Sailors s LEFT OUTER JOIN Reserves r ON s.sid = r.sid;

-- Right Outer Join
SELECT * FROM Sailors s RIGHT OUTER JOIN Reserves r ON s.sid = r.sid;

-- (Optional) Full Outer Join
-- SELECT * FROM Sailors s FULL OUTER JOIN Reserves r ON s.sid = r.sid;

-- Create Indexes
CREATE INDEX idx_sname ON Sailors(sname);